#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.fourkeys.google_storage_bucket.gh_audit_log_archieve_local: Refreshing state... [id=off-net-dev-gh-audit-log-archieve-local]
module.fourkeys.google_storage_bucket.events_archieve_local: Refreshing state... [id=off-net-dev-events-archieve-local]
module.fourkeys.google_storage_bucket.events_station_local: Refreshing state... [id=off-net-dev-events-station-local]
module.fourkeys.google_storage_bucket.gh_audit_log_station_local: Refreshing state... [id=off-net-dev-gh-audit-log-station-local]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.fourkeys.google_bigquery_dataset.dataset will be created
  + resource "google_bigquery_dataset" "dataset" {
      + creation_time              = (known after apply)
      + dataset_id                 = "local_4keys"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + description                = "This is a test description"
      + effective_labels           = (known after apply)
      + etag                       = (known after apply)
      + friendly_name              = "local_4keys"
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "northamerica-northeast1"
      + max_time_travel_hours      = (known after apply)
      + project                    = "off-net-dev"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = (known after apply)
    }

  # module.fourkeys.google_bigquery_table.batch_events will be created
  + resource "google_bigquery_table" "batch_events" {
      + creation_time       = (known after apply)
      + dataset_id          = "local_4keys"
      + deletion_protection = false
      + effective_labels    = (known after apply)
      + etag                = (known after apply)
      + expiration_time     = (known after apply)
      + id                  = (known after apply)
      + last_modified_time  = (known after apply)
      + location            = (known after apply)
      + num_bytes           = (known after apply)
      + num_long_term_bytes = (known after apply)
      + num_rows            = (known after apply)
      + project             = "off-net-dev"
      + schema              = jsonencode(
            [
              + {
                  + description = "Current timestamp when payload was ingested by whatever Api"
                  + mode        = "REQUIRED"
                  + name        = "ingestion_time"
                  + type        = "TIMESTAMP"
                },
              + {
                  + description = "Response body of whatever Api"
                  + mode        = "NULLABLE"
                  + name        = "data"
                  + type        = "JSON"
                },
            ]
        )
      + self_link           = (known after apply)
      + table_id            = "batch_events"
      + terraform_labels    = (known after apply)
      + type                = (known after apply)

      + time_partitioning {
          + expiration_ms = (known after apply)
          + field         = "ingestion_time"
          + type          = "DAY"
        }
    }

  # module.fourkeys.google_bigquery_table.batch_logs will be created
  + resource "google_bigquery_table" "batch_logs" {
      + creation_time       = (known after apply)
      + dataset_id          = "local_4keys"
      + deletion_protection = false
      + effective_labels    = (known after apply)
      + etag                = (known after apply)
      + expiration_time     = (known after apply)
      + id                  = (known after apply)
      + last_modified_time  = (known after apply)
      + location            = (known after apply)
      + num_bytes           = (known after apply)
      + num_long_term_bytes = (known after apply)
      + num_rows            = (known after apply)
      + project             = "off-net-dev"
      + schema              = jsonencode(
            [
              + {
                  + description = "Current timestamp when payload was ingested by whatever Api"
                  + mode        = "REQUIRED"
                  + name        = "ingestion_time"
                  + type        = "TIMESTAMP"
                },
              + {
                  + description = "Response body of whatever Api"
                  + mode        = "NULLABLE"
                  + name        = "data"
                  + type        = "JSON"
                },
            ]
        )
      + self_link           = (known after apply)
      + table_id            = "batch_logs"
      + terraform_labels    = (known after apply)
      + type                = (known after apply)

      + time_partitioning {
          + expiration_ms = (known after apply)
          + field         = "ingestion_time"
          + type          = "DAY"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @lendly-telus-com, Action: `pull_request`*